#+title: TODO
#+TODO: TODO PROG REVW BLOK | DONE

#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2024-11-25 Mon 22:08]
| Headline                    |   Time |      |
|-----------------------------+--------+------|
| *Total time*                | *2:55* |      |
|-----------------------------+--------+------|
| Fix mathjax                 |   0:07 |      |
| Add articles                |   2:48 |      |
| \_  Nix page setup overview |        | 0:49 |
| \_  Image test page         |        | 0:40 |
| \_  Tv channel overview     |        | 1:19 |
#+END:


* DONE Fix mathjax
:PROPERTIES:
:Effort:   1h
:END:
:LOGBOOK:
CLOCK: [2024-11-22 Fri 09:47]--[2024-11-22 Fri 09:54] =>  0:07
:END:

* DONE Fix mermaid
:PROPERTIES:
:Effort:   1h
:END:

* DONE Fix lists

Tailwind's fault

* PROG Change index page

* PROG Add articles

** DONE Markdown example

** PROG Nix page setup overview
:PROPERTIES:
:Effort: 1h30min
:END:
:LOGBOOK:
CLOCK: [2024-11-25 Mon 20:43]--[2024-11-25 Mon 21:32] =>  0:49
:END:

** TODO Lisp overview
:PROPERTIES:
:Effort: 1h30min
:END:

** DONE Image test page
:PROPERTIES:
:Effort: 30min
:END:
:LOGBOOK:
CLOCK: [2024-11-21 Thu 23:52]--[2024-11-22 Fri 00:32] =>  0:40
:END:

With carousel

*** DONE Move css and js from to assets folder

*** DONE Move images to assets

*** DONE Fix styles

** DONE Tv channel overview
:PROPERTIES:
:Effort: 30min
:END:
:LOGBOOK:
CLOCK: [2024-11-25 Mon 19:57]--[2024-11-25 Mon 20:33] =>  0:36
CLOCK: [2024-11-22 Fri 08:52]--[2024-11-22 Fri 09:35] =>  0:43
:END:

Maybe add a flexbox to better display channels
